package homeworks.homework5;

public class Homework {

    /**
     * 0. Осознать код, который мы написали на уроке.
     * 1. По аналогии с командой отправки сообщений, реализовать следующие команды:
     * 1.1 BroadcastMessageRequest - послать сообщение всем пользователям (кроме себя);
     * 1.2 UsersRequest - получить список всех логинов, которые в данный момент есть в чате (в любом формате);
     * 1.3 Disconnect - клиент оповещает сервер о том, что он отключился;
     * Доп задание: При отключении юзера, делать рассылку на остальных
     *
     * Можно сделать только один пункт из 1.1 - 1.3.
     */
}
